Repository: brunodias77/MyRecipeBook
Catalog: src/MRB.Exceptions/ResourceMessagesException.*.resx
Languages: pt_br

# EMAIL_ALREADY_REGISTERED
source: The name cannot be empty.
pt_br: Esse e-mail ja esta cadastrado

# AT_LEAST_ONE_INSTRUCTION
source: The recipe must have at least one insttruct.
pt_br: A receita deve ter no mínimo um Instrucao.

# COOKING_TIME_NOT_SUPPORTED
source: The preparation time is invalid.
pt_br: O tempo de preparo é invalido

# DIFFICULTY_LEVEL_NOT_SUPPORT
source: Difficulty level not supported.
pt_br: Nível de dificuldade não suportado

# DISH_TYPE_NOT_SUPPORT
source: Dish tyoe not supported
pt_br: Tipo de prato nao suportado.

# EMAIL_EMPTY
source: The e-mail cannot be empty.
pt_br: O campo e-mail esta vazio

# EMAIL_INVALID
source: The e-mail address is invalid.
pt_br: O campo e-mail é invalido.

# EMAIL_OR_PASSWORD_INVALID
source: Invalid email or password.
pt_br: E-mail ou senha invalida.

source: Ingredient empty
pt_br: Ingrediente vazio.

source: Instruction empty
pt_br: Instrução esta vazia.

# INSTRUCTION_EXCEEDS_LIMIT_CHARACTERS
source: Instruction exceeds limit characteres
pt_br: A instrucao excede o limite de caracteres

# NAME_EMPTY
source: The name cannot be empty.
pt_br: Nome esta vazio.

source: Non negative instruction step
pt_br: Passo de instrucao nao negativa.

# NO_TOKEN
source: Token not find
pt_br: Token não encontrado.

# PASSWORD_EMPTY
source: The password cannot empty
pt_br: Senha esta vazia.

# PASSWORD_GREATER_THAN_OR_EQUAL_TO
source: The password must be longer than 6 characters.
pt_br: A senha deve conter no minimo 6 caracteres

# PASSWORD_INVALID
source: Invalid password. The password field must contain at least 6 characters
pt_br: Senha invalida.

# RECIPE_MINIMUM_ONE_INGREDIENT
source: The recipe must have at least one ingredient.
pt_br: A receita deve ter no mínimo um ingrediente.

# RECIPE_TITLE_EMPTY
source: The title of the recipe must be entered.
pt_br: O título da receita deve ser informado.

# TWO_OR_MORE_INSTRUCTIONS_SAME_ORDER
source: Two instructions with the same step number.
pt_br: Duas instrucoes com o numero do passo igual.

source: Unknown error
pt_br: Erro Desconhecido !

# USER_WITHOUT_PERMISSION_ACCESS_RESOURCE
source: User does not have permission to access this resource.
pt_br: Usuário não tem permissão para acessar esse recurso.

source: Recipe not found
pt_br: A receita não foi encontrada.

# INVALID_NUMBER_INGREDIENTS
source: Invalid number of ingredients. The list must contain between 1 to 5 ingredients.
pt_br: Número inválido de ingredientes. A lista deve conter entre 1 a 5 ingredientes.

# DUPLICATED_INGREDIENTS_IN_LIST
source: Ingedients duplicated
pt_br: Ingredientes duplicatos

source: Ingredient not following pattern.
pt_br: O ingrediente não segue o padrão.

# ONLY_IMAGES_ACCEPTED
source: Only images (PNG, JPG, JPEG) are accepted.
pt_br: Somente imagens (PNG, JPG, JPEG) são aceitas.

# EXPIRED_SESSION
source: Your session has expired. Please log in again to continue.
pt_br: Sua sessão expirou. Faça login novamente para continuar.

# INVALID_SESSION
source: We couldn't find a valid session. Please log in to access this feature.
pt_br: Não foi possível encontrar uma sessão válida. Inicie sessão para aceder a esta funcionalidade.
